; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-89)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 - object)
 (:init 
    (arm-empty)
    (clear b9)
    (on b9 b6)
    (on b6 b22)
    (on b22 b25)
    (on b25 b12)
    (on b12 b15)
    (on b15 b3)
    (on b3 b11)
    (on b11 b17)
    (on b17 b2)
    (on b2 b13)
    (on b13 b14)
    (on b14 b23)
    (on b23 b7)
    (on b7 b19)
    (on b19 b8)
    (on b8 b26)
    (on b26 b16)
    (on b16 b5)
    (on b5 b4)
    (on-table b4)
    (clear b21)
    (on b21 b1)
    (on-table b1)
    (clear b10)
    (on b10 b18)
    (on b18 b20)
    (on b20 b24)
    (on-table b24))
 (:goal (and 
(on-table b24)
(on-table b6)
))
)

; plan
1. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 1 of 2
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 2
3. (unstack b6 b22)
   deleted: (on b6 b22) (clear b6) (arm-empty)
   added: (holding b6) (clear b22)
   goals met: 1 of 2
4. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 2
